title: Detection of Nirsoft NetPass parameter usage
status: stable
description: NetPass supported some characteristic parameters until version 1.34 that are recognized by this rule
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        CommandLine:
            - "* /stext *"
            - "* /stab *"
            - "* /scomma *"
            - "* /stabular *"
            - "* /shtml *"
            - "* /sverhtml *"
            - "* /sxml *"
    condition: selection
level: high
